import FAQ from "./FAQ";

function FAQSection() {
  return (
    <section className="p-4 pb-8 text-center">
      <h3 className="mb-2 text-3xl">قسم الأسئلة الشائعة</h3>
      <div className="flex flex-col gap-6 ">
        <FAQ title={"كيف سيعمل الموقع؟"}>
          <p className="text-lg text-right lg:w-1/2">
            ستستطيع كمعلم أن تصمم امتحان جديد وعند انتهائك سيتم ارسال اشعار لكل
            الطلبة المشتركين معك. حتي يستطيع الطالب أداء الامتحان. وبعد انتهاء
            الطالب من الامتحان، سيتم ارسال تقرير بالكامل لك وللطالب عن أداءه
            للامتحان.
          </p>
        </FAQ>
        <FAQ title={"هل أستطيع اعطاء نصائح للطلبة مباشرة بعد الامتحان؟"}>
          <p className="text-lg text-right lg:w-1/2">
            بالتأكيد، موقعنا يوفر لك طريقتين حتي تساعد طلابك، فيمكنك وأنت تصمم
            الامتحان، ان تضع لكل سؤال تفسير للإجابة. يراها الطالب بعد الانتهاء
            من الامتحان. وبعد انتهاء الطالب للامتحان تستطيع الاطلاع علي أداءه في
            الامتحان وارسال تعليق له عن الامتحان وما يجب أن يركز عليه.
          </p>
        </FAQ>
        <FAQ title={"هل لكم برنامج علي الموبايل؟"}>
          <p className="text-lg text-right lg:w-1/2">
            علي الرغم من أننا لا نملك برنامج علي الموبايل، إلا أن موقعنا مصمم
            خصيصا ليكون متوافق مع جميع الهواتف المحمولة، حتي نضمن تجربة سهلة بلا
            أي مشاكل.{" "}
          </p>{" "}
        </FAQ>
        <FAQ title={"هل يستطيع الموقع تحمل عدد طلاب كبير؟"}>
          <p className="text-lg text-right lg:w-1/2">
            بالتأكيد، صممنا هذا الموقع ليستطيع تحمل عدد كبير من الطلاب في نفس
            الوقت
          </p>
        </FAQ>
      </div>
    </section>
  );
}

export default FAQSection;
